[{"title":"Awareness","tags":["Hybrid","Tutorials"],"author":"ANDYMAN","markdown":" \n## Watching for Holes\nYou must be watching the map all the time and keeping a close eye on your section for any changes. If you see a part of your base start to disappear you must alert your team. The quicker you catch it the better. If you miss a hole for more than 3 minutes it can become massive and you will have lost a big chunk of area without even knowing. Keep an eye on your map and alert your team so that whoever is digging doesn't get free area from your base.\n\n## Bridging\n### Where to bridge\n<img width=\"200\" src=\"img/where_to_bridge.png\" alt=\"Where to bridge\"/>\n\nFinding the right spot to start bridging is very important. Below is an example of where you could bridge. The idea is taking a chunk of area from another team by connecting 2 parts of your own base. This can be an effective way of gaining a lot of area in a quick time.\n### How to bridge safely\nBridging is incredibly important and an amazing way of gaining lots of area, However sometimes it might not work out and you can get trapped and killed. To avoid getting trapped and killed there a number of things you can do:\n- Having a second way out. Sometimes having a backup escape route can save your life when your main bridge gets cutoff. \n- Building a thicker bridge. This is kinda obvious but still important. The longer your bridge is the thicker is needs to be. \n- Always keeping a very close eye on your bridge to make sure if it is getting destroyed you can get there straight away. \n- Keeping a builder to patrol the bridge. This can mean that if it does get attacked your builder can hold off the attack while you either finish it off or get back to safety.\n\n## Your Team\n### Class Selection\nKnowing what type of players (builder or hybrid) are on your team is incredibly important. For example if your team is lacking a bit of strength in building then changing your build to a Builder hybrid or even a Balanced hybrid will help your team's weakness and make it stronger. Another example is that if your team has a strong amount of builders then going towards an Attacking Hybrid would benefit your team more. Last example is that if your team has speed builders but a slight weakness in frontlining then the frontlining hybrid will strongly benefit your team. It is all about knowing what is on your team and selecting the correct hybrid for the job.\n\n### Death Prediction\nLooking at your team around you when in fights and seeing how they are doing can have a massive effect on the whole game. If you see one of your team start to lose focus or is getting some close calls in-terms of near death, then telling them to be more careful or to watch out or even to focus can avoid a string of deaths and save your team. If you see a player on your team who is getting some close calls even after you have told them then preparing for them to die is incredibly important. If you prepare and pick your target once your team member dies then you can get a counter kill very often and even out the fight or even just getting in a safer position so that when they die you are safe and wont make things worse. The key here is all about watching and keeping a close eye on your team during fights and knowing what is going to happen before it happens.\n\n## Enemy\n### Enemy Strength Level\nBeing aware of how strong your enemy is can save you a lot of time. For example lets say your up against a team with 2 players who aren't levelled. Rather than taking over their base slowly and carefully you should just steam through their base quickly and take advantage of the situations. However, If a team is full of players who are all near max level then steaming through their base quickly will only get you killed. Knowing your enemy's strength and when to strike and when not to strike is key.\n\n### Player Weakness\nNoticing when a player on an enemy team who is poking out of their frontline slightly from time to time or even when they seem maybe a little bit slow to react to a tower you have just destroyed infront of them can be a game changer. When you see a weakness you have to go for it hard, there is little point in attacking a player who seems harder to kill when there is an easier one to kill in the same area. Often killing one player will lead to killing another, so spotting weakness and exploiting that weakness can be a massive game changer. It is all about spotting when a player makes a mistake. A mistake being slow to react to destroyed towers, leaves there base during bullet stacks, pokes out of there base ect...\n\n### Base Weakness\nBeing able to see when an enemy base has a weak border is so so important. There is little point in attacking part of a base which is heavily reinforced and guarded when there is a weak part which isnt guarded not that far away. If see a team you want to take out first you should scout their border with you and make a mental note of there strong parts and the weak parts. You want to attack the weak parts and avoid the strong parts. A frontline is only as strong as its weakest section, exploit that fact and the benefits will be big."},{"title":"Game Sprites","tags":["Design","Skins"],"author":"Risky Player 13","markdown":" \nWhen using skin editor there is an option to replace game sprite. As you might know this changes the way thing like towers, bullets, ffa bots! and ... will look.\nWhen attempting to replace game sprite, one might note that there are a lot of options, which might be confusing.\nHere we try to make a guide about that. There is lot to be done so any information you have regarding the sprites is appreciated.\n\nFor each sprite we are looking for Four properties:\n\n- What they do.\n- In which settings they do that (game mode, colorblind mode, dark theme or light theme, ...)\n- Scaling Ratio; As you might know, the game scales the same PNG file for different sprites differently so this is very important to know. I usually test with a 256x256 PNG and check for the results.\n- Tint or no tint "},{"title":"Hybrid Classes","tags":["Hybrid","Tutorials"],"author":"ANDYMAN","markdown":"## Standard Hybrid Builds\nHere are some of the most commonly used hybrid builds. \n\n### Attacking hybrid\n<img src=\"/api/upgrades?build=4848008\" />\n\nThe Attacking Hybrids main strength is its Player Speed. This means that you can bullet stack incredibly effectively and catch builders off guard more often. It has increased Bullet Range so that you are more likely to get a bounced shot. The increased Player Speed also allows for dodging which means you can leave your area sometimes and get closer to enemies and put them under more pressure to get the kill.\n\n### Balanced Hybrid\n<img src=\"/api/upgrades?build=2738048\" />\n\nThe Balanced Hybrid is designed so that it can be useful when shooting and reinforcing if needed. The shield allows for reinforcing when there is a weakness in the borders or just a lack of a builder.\n\n## Upgrade Rules\nWhen Changing or slightly adjusting your build you should stick to the following rules:\n- **Use 3-5 Bullet Range.** This is because anymore than 5 means you are wasting upgrade points as you will never need anymore than 5 Bullet Range. Having less than 3 bullet range will mean you are missing out on kills that you could of otherwise had, it could also lead to you becoming too reliant on one style of attacking. The less Bullet Range you have the further forward you have to be to make up for that so if you have too little it will mean you will need to be outside of your area to get kills.\n- **Always use 8 Tower Health.** Less than full tower health can lead to weakness in your frontline and can end up getting builders killed or making it easier to dig through the base. \n- **Bullet Reload must never be below 7.** The more Bullet Reload you have the more damage you can do. \n- **Bullet Speed should never be below 6.** Bullet Speed is important because it means you give your enemy less time to react to what is going your doing. Low Bullet Speed is easy to defend against and should never be below 6."},{"title":"Layering and Visibility","tags":["Design","Skins"],"author":"Hyperion","markdown":"While making a skin, the editor has these feature to keep your rotors organized: Layering and Visibility\n\nThese two features help you for doing transitions between stances and to give your skin the right volume.\n\nIn visibility, the editor allows you to:\n- Make one image visible while moving, while still or in both stances\n- Creating transitions\n\nIf you want your rotors to still show up when idle and moving, make the value of visibility 0. If you don't want this, then you'll choose between 1 and 2, so the rotor you chose will only show up in one stage, depending on what you want to do with your skin animation. For making it visible while moving choose 1, and for making it visible while still make it 2.\n\nAlways make sure the rotors gets a number here, if you leave it blank it will automatically change to 0\n\nAnother important step to make sure your rotors are well organized is the Layering of the rotors. When uploading rotors, the editor allows you to choose in which layer one rotor will be, either in the highest layers or in the lowest one. If you want your rotor in the lowest layer, make the value 0. From that, choose ahigher* number for the other rotors so they appear on the highest layers.\n\nIf you choose a value similar to one from another rotor, the highest one in the order of rotors will be over the other one.\n\nBoth Layering and Visibility are important at the final touches of your skin. Sometimes the rotors look well placed once moving but seems different when  idle because one rotor disappeared or a new one is there. Although visibility doesn't affect the layering, always check it before using the skin to avoid these troubles. \nFor example, this is an image from the rotors of Golden Claw. \n\n![Visibility common mistakes](img/visibility_common_mistakes.png)\n\n- The blue part is a tinted fade in the back I want to only show up when moving, so I chose the lowest layer and the value of visibility 1 (visible when moving).\n- The red part is a No Tint that I want it to show up every time, so it is on the top layer and has 0 as their visibility value (all the time)\n- The green parts are other rotors, like body parts, tinted stuff and different fades, so they have a different layer each between 0 to 10, but I chose their visibility value to be 2 so that they all are visible once staying still, making a transition effect. "},{"title":"Shooting Angles","tags":["Hybrid","Tutorials"],"author":"ANDYMAN","markdown":"## Blocking Escapes\n<img width=\"200\" src=\"img/blocking_escapes.png\" alt=\"Blocking escapes\"/>\n\nUsing your bullets to block escapes is a simple but incredibly important thing to do. If someone has been cut off from their area as seen in the example below then their are 2 shooting lines you must be using. Shooting line 1 is cutting the player off so that they cannot escape or if they do try they will be killed. Shooting line 2 is doing 2 things, firstly it is shooting the tower in front of them forcing them to deal with you and make sure their land doesnt get smaller and killed. The second thing shooting line 2 is doing is baiting the player into trying to escape and then you switch to shooting line 1 to kill them.\n\n## Bounce Gaps\n<img width=\"200\" src=\"img/bounce_gaps.png\" alt=\"Bounce gaps\"/>\n\nBounce kills are one of if not the best way to get kills in defly. You want to be shooting away from the player so that you can get the bounce in-behind the player where you will end up catching them off guard. You want to target a tower so that when the tower is destroyed the player will be exposed to your bullets and die (an example of this is shown below).\n\n## Bounce Closes\n<img width=\"200\" src=\"img/bounce_closes.png\" alt=\"Bounce closes\"/>\n\nWhen you spot gaps like this where the target player is trying to close you want to make sure that just before the target player does close the gap that you get bullets inside that gap so when they close it the bullets will bounce everywhere and kill the player (below is an example of the shooting line).\n\n## Slowing Angles\n<img width=\"200\" src=\"img/slowing_angles.png\" alt=\"Where to bridge (example)\"/>\n\nThis is all about slowing players down and trying to bait into a kill. Their are 2 different lines in this example similar to the lines in Blocking Escapes. Shooting line 1 is slowing the player from closes the gap. Shooting line 2 is doing 2 things, firstly it is shooting the tower in front of them forcing them to deal with you and therefore stopping them closing the gap. This is also a very good shooting line to stack your bullets as the player might be more focused on closing the gap. The second thing shooting line 2 is doing is baiting the player into trying to close the gap and then you switch to shooting line 1 to kill them or you try to get a single bullet (potshot) into the small area in-front of them where they will build towers to slowly edge closer to closing the gap and as they build towers if you time your shot correctly you can sometimes get a shot in that area and kill them.\n\n## Tower Destruction Angles\nYou want to be making sure that when you are destroying a tower you want to be shooting at it so that once a tower is destroyed your bullets will be directly hitting a target player or bouncing off a wall and then hitting the player. You do not want to be destroying a tower in a direction that doesn't trouble your target.\n\n\n## Tower Priority\nTower priority is all about which tower has the most connections to it, a tower with a higher number of connections will be harder for the target to defend and therefore be more likely to get you a kill. Targeting these towers at the right time to trouble your target can be incredibly powerful. When shooting these high priority towers make sure to be shooting them in a direction that is threatening your target.\n\n## Key\n<img width=\"200\" src=\"img/key.png\" alt=\"Where to bridge (example)\"/>"},{"title":"Skills and Tricks","tags":["Hybrid","Tutorials"],"author":"ANDYMAN","markdown":"## Expanding under fire\n\nThis is a simple skill which shouldn't really need to be on here, however I see so many players not do this effectively so I felt I should add it. When you there is open territory during a battle you must be expanding towards their border whenever there is an opportunity to do so. The enemies bullets might sometimes move away for a second, and this is when you must take advantage of that small window of opportunity and expand ahead of their fire. However, you must wait for your chance and be patient but ready. Avoiding bullets while expanding is important, which needs practice and experience. This is one of the most important skills for a hybrid and the better you are at it the better hybrid you are.\n\n## Bullet stacking\nThis is a very common skill these days which all hybrids must know. To Bullet Stack you move away from your target in the opposite direction. You then start firing bullets as you move towards your target. The aim is to get your bullets close together so that whoever is defending cannot repair quick enough and is caught off guard. The more Player Speed you have the more effective this skill is, however it is still effective at 0 player speed.\n\n## Fingerdancing\nBuilding and shooting at the same time is an extremely useful skill which will help defend area as well as speed things up. To do this you must alternate your clicks. Press left click to shoot and then right click to build. You must press them quick enough so that you shoot as if you were holding left click down but you will also be builder. This skill is all about finding the right rhythm to alternate your clicks. You must alternate quick enough so that you shoot at full reload but slow enough so that you can do it for a long period of time and not get worn out. Doing this correctly for a long period of time is hard and takes a lot of practice to get right. This skill is mostly useful when clearing out area and splitting it up.\n\n## Target switching\nTarget switching is when you are shooting at a tower which keeps on getting repaired, so you switch to a different tower in a place on screen but a little bit away from the builder. This will allow you to take down a tower while the builder is trying to move to the new tower you are shooting at. It is a good way to move builders around to where you want them. It can also be a used to frustrate good builders. This is a great way to continue to push against even a good builder.\n\n## Shield switching\nShield switching is when your shooting a tower and the shield pops up so you switch to a tower which doesnt have the shield up and then you switch back when the other shield has disappeared. This is a simple skill which can require practice and focus. This will make you more effective at destroying towers and gaining area.\n\n## Potshots\nThis has become more and more common for builders, but yes it can be a really useful tool for hybrids to use when they see an opportunity to do so. A Potshot is simply a single bullet which catches a player off guard and kills them. Catching a player off guard like this can be an amazing way to get a kill which could of taken a while to get. Even top players die to a good potshot from time to time so getting good at this skill is a very useful one to have. But do not over use this as a hybrid because most of the time you wont get the kill so you don't want to waste your time.\n\n## Backing off\nBacking off so that the enemy players think you have gone elsewhere can be an amazing strategy sometimes when things get tough. Back off so that the enemy players cannot see you and wait for 5 maybe 10 seconds for them to leave and think you are gone. Then you simply go back and sometimes they will have just left and gone elsewhere. This simple trick will allow you to keep gaining area. This doesn't always work but when it does it is amazing and simple.\n\n## Back Fire\nBack fire is when you move away from your target and as your doing so shoot a single bullet behind you where the enemy is. This can be a good way to catch someone off just as they think they won the battle. It is a simple but good tool for hybrid.\n\n## Shooting at a wall just before it breaks\nShooting at a wall just before the connecting tower breaks can be a good way to catch a player before they are prepared. This can be done by shooting at a tower then before your last bullet hits and breaks the tower you want to switch your fire to a connecting wall where the target maybe slightly exposed."},{"title":"Skin File Tips","tags":["Design","Skins"],"author":"Risky Player 13","markdown":" \nThere are mostly no major limitations to want you can upload to the skin editor except for the file size especially if you are making skins just for the fun of it. This being said, some people might have other things in mind like game performance or asking the developer to add the skin to the game.\n\nIf you want your skin to have a good chance of being added to the game, you definitely want to minimize the text file size of your skin since when a skin is added to the game, it increases the initial loading time of the game when you press Play button, and Defly's Developer cares about this.\n\nAnother thing to note is unnecessary layers (rotors). Each layer that is added to skin affects game's performance so you might want keep the number of your layers as low as possible.\n\nHere are some tips for reducing text file size:\n\n- My guess about optimal text file size is something about 25kbs. It's just a guess based on the reconstruction of the default skin using the PNG files in the skin design channel of the main server (and some other skins). Try to get your text file size to something about that.\n\n- It is stated in the main server's skin design that the PNG file should be 256x256. This obviously affects the file size a lot, but the thing is that your PNG file doesn't necessarily need to be 256x256, you see a lot PNG files used in the game that are larger than that. But more importantly, your PNG file can be smaller than 256x256. This is especially useful if you are struggling to lower your file size; and also have this in mind that there are scaling options in the skin editor that can resize your original PNG file so they would look as if they were 256x256 (with less quality).\n\n- Changing The bit depth of your PNG file can help a lot in reducing file size. Usually the bit depth of PNG files is set to RGBA8 (Red, Green, Blue, Alpha (transparency)) or RGBA16. The thing is that most of your PNG files for skin editor will be black and white and will be later tinted by the game. So you can use other bit depths that make your PNG file appear black and white like GrayAlpha8 to reduce your PNG file size.\nI doubt that this will be ever the case but if your PNG file doesn't have any transparent areas, you can remove the Alpha too.\nBit depth setting is usually available when you are saving or exporting your PNG file."}]